Data/Section 5/5.2/Client/VM1_Instance2/rep1/output_C2_T1_W64_K6_R1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       41216 ops,     474 (avg:     457) ops/sec, 1.69MB/sec (avg: 1.63MB/sec),  4.21 (avg:  4.35) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         228.99          ---          ---      4.34500       237.79
Gets         228.96      1373.78         0.00      4.35800      1429.39
Waits          0.00          ---          ---      0.00000          ---
Totals       457.95      1373.78         0.00      4.35200      1667.19


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.500         0.01
SET       1.600         0.14
SET       1.700         0.62
SET       1.800         1.68
SET       1.900         3.76
SET       2.000         6.46
SET       2.100        10.19
SET       2.200        14.12
SET       2.300        18.20
SET       2.400        22.39
SET       2.500        26.09
SET       2.600        29.48
SET       2.700        32.54
SET       2.800        35.29
SET       2.900        37.67
SET       3.000        40.10
SET       3.100        42.10
SET       3.200        43.94
SET       3.300        45.68
SET       3.400        47.37
SET       3.500        48.81
SET       3.600        50.35
SET       3.700        51.72
SET       3.800        53.20
SET       3.900        54.49
SET       4.000        55.87
SET       4.100        57.11
SET       4.200        58.46
SET       4.300        59.79
SET       4.400        61.14
SET       4.500        62.28
SET       4.600        63.63
SET       4.700        64.90
SET       4.800        66.15
SET       4.900        67.49
SET       5.000        68.86
SET       5.100        70.30
SET       5.200        71.60
SET       5.300        72.84
SET       5.400        74.22
SET       5.500        75.31
SET       5.600        76.52
SET       5.700        77.78
SET       5.800        79.03
SET       5.900        80.12
SET       6.000        81.29
SET       6.100        82.43
SET       6.200        83.48
SET       6.300        84.46
SET       6.400        85.44
SET       6.500        86.32
SET       6.600        87.10
SET       6.700        87.81
SET       6.800        88.51
SET       6.900        89.15
SET       7.000        89.66
SET       7.100        90.20
SET       7.200        90.75
SET       7.300        91.27
SET       7.400        91.68
SET       7.500        92.08
SET       7.600        92.49
SET       7.700        92.84
SET       7.800        93.15
SET       7.900        93.47
SET       8.000        93.77
SET       8.100        94.08
SET       8.200        94.32
SET       8.300        94.58
SET       8.400        94.80
SET       8.500        95.03
SET       8.600        95.27
SET       8.700        95.45
SET       8.800        95.62
SET       8.900        95.80
SET       9.000        95.93
SET       9.100        96.12
SET       9.200        96.26
SET       9.300        96.41
SET       9.400        96.53
SET       9.500        96.70
SET       9.600        96.86
SET       9.700        97.01
SET       9.800        97.11
SET       9.900        97.18
SET      10.000        97.68
SET      11.000        98.23
SET      12.000        98.66
SET      13.000        98.97
SET      14.000        99.19
SET      15.000        99.36
SET      16.000        99.48
SET      17.000        99.56
SET      18.000        99.66
SET      19.000        99.71
SET      20.000        99.75
SET      21.000        99.80
SET      22.000        99.83
SET      23.000        99.87
SET      24.000        99.89
SET      25.000        99.91
SET      26.000        99.92
SET      27.000        99.94
SET      28.000        99.95
SET      29.000        99.95
SET      30.000        99.96
SET      32.000        99.96
SET      33.000        99.97
SET      34.000        99.97
SET      37.000        99.98
SET      41.000        99.98
SET      43.000        99.99
SET      52.000        99.99
SET      56.000       100.00
SET      87.000       100.00
---
GET       1.700         0.01
GET       1.800         0.10
GET       1.900         0.52
GET       2.000         1.46
GET       2.100         3.57
GET       2.200         6.50
GET       2.300        10.39
GET       2.400        14.71
GET       2.500        19.39
GET       2.600        23.81
GET       2.700        27.92
GET       2.800        32.01
GET       2.900        35.55
GET       3.000        38.95
GET       3.100        41.82
GET       3.200        44.23
GET       3.300        46.54
GET       3.400        48.66
GET       3.500        50.40
GET       3.600        52.07
GET       3.700        53.58
GET       3.800        55.08
GET       3.900        56.39
GET       4.000        57.72
GET       4.100        58.97
GET       4.200        60.15
GET       4.300        61.33
GET       4.400        62.45
GET       4.500        63.63
GET       4.600        64.87
GET       4.700        66.03
GET       4.800        67.18
GET       4.900        68.27
GET       5.000        69.45
GET       5.100        70.64
GET       5.200        71.83
GET       5.300        73.09
GET       5.400        74.29
GET       5.500        75.69
GET       5.600        77.01
GET       5.700        78.30
GET       5.800        79.57
GET       5.900        80.91
GET       6.000        82.19
GET       6.100        83.32
GET       6.200        84.47
GET       6.300        85.57
GET       6.400        86.44
GET       6.500        87.31
GET       6.600        88.07
GET       6.700        88.74
GET       6.800        89.31
GET       6.900        89.95
GET       7.000        90.59
GET       7.100        91.14
GET       7.200        91.59
GET       7.300        91.95
GET       7.400        92.33
GET       7.500        92.66
GET       7.600        92.95
GET       7.700        93.23
GET       7.800        93.62
GET       7.900        93.84
GET       8.000        94.13
GET       8.100        94.40
GET       8.200        94.64
GET       8.300        94.90
GET       8.400        95.12
GET       8.500        95.31
GET       8.600        95.53
GET       8.700        95.69
GET       8.800        95.88
GET       8.900        96.07
GET       9.000        96.24
GET       9.100        96.43
GET       9.200        96.62
GET       9.300        96.76
GET       9.400        96.90
GET       9.500        97.02
GET       9.600        97.14
GET       9.700        97.25
GET       9.800        97.37
GET       9.900        97.50
GET      10.000        98.02
GET      11.000        98.62
GET      12.000        98.93
GET      13.000        99.16
GET      14.000        99.35
GET      15.000        99.46
GET      16.000        99.58
GET      17.000        99.62
GET      18.000        99.69
GET      19.000        99.74
GET      20.000        99.76
GET      21.000        99.80
GET      22.000        99.84
GET      23.000        99.86
GET      24.000        99.87
GET      25.000        99.88
GET      26.000        99.90
GET      29.000        99.91
GET      30.000        99.91
GET      32.000        99.92
GET      33.000        99.93
GET      34.000        99.94
GET      41.000        99.94
GET      44.000        99.95
GET      45.000        99.96
GET      48.000        99.97
GET      49.000        99.97
GET      57.000        99.98
GET      65.000        99.99
GET      88.000        99.99
GET      97.000       100.00
GET     140.000       100.00
---